chore: replace ascii diagram with a mermeid diagram
